      * "Characters" are lowest in the hierarchy and they cannot be
      * divided further. THe COBOL Character Set includes 78 characters
      * which are shown below: 
      *
      *    A-Z - Alphabets (UPPER CASE)
      *    a-z - Alphabets (lower case)
      *    0-9 - Numeric 
      *    ' ' - Space
      *     +  - Plus
      *     -  - Minus or Hyphen
      *     *  - Asterisk 
      *     /  - Forward Slash
      *     $  - Currency Sign
      *     ,  - Comma
      *     ;  - Semicolon
      *     .  - Deciaml Point or Period
      *     "  - Quotation Marks
      *     (  - Left Parenthesis
      *     )  - Right Parenthesis
      *     >  - Greater than
      *     <  - Less than
      *     :  - Colon
      *     '  - Apostrophe
      *     =  - Equals
      * 
       IDENTIFICATION DIVISION.
           PROGRAM-ID. CHARACTERS.

       PROCEDURE DIVISION.
           DISPLAY "SEE THE VALID CHARACTERS THAT ONE CAN USE ABOVE".
       STOP RUN.
       