      * Sorting of data in a file or merging of two or more files is a 
      * common necessity in almost all business-oriented applications. 
      * Sorting is used for arranging records either in ascending or 
      * descending order, so that sequential processing can be 
      * performed. 
      *
       IDENTIFICATION DIVISION.
           PROGRAM-ID. INTERNAL-SORTING.
       
       PROCEDURE DIVISION.
           DISPLAY "INTERNAL-SORTING".
       STOP RUN.
       