      * File handling verbs are used to perform various operations
      * on files. The following file handling verbs will be covered:
      *    - Open
      *    - Read
      *    - Write
      *    - Rewrite
      *    - Delete
      *    - Start
      *    - Close
      *
       IDENTIFICATION DIVISION.
           PROGRAM-ID. FILE-HANDLING-VERBS.
       
       PROCEDURE DIVISION.
           DISPLAY "FILE-HANDLING-VERBS".
       STOP RUN.
       