      * COBOL layout is the description of use of each field and the 
      * values present in it. Following are the data description
      * entries used in COBOL:
      *    - Redefines Clause
      *    - Renames Clause
      *    - Usage Clause
      *    - Copybooks
      * 
       IDENTIFICATION DIVISION.
           PROGRAM-ID. DATA-LAYOUT.
       
       PROCEDURE DIVISION.
           DISPLAY "DATA LAYOUT".
       STOP RUN.
       