      * Conditional statements are used to change the execution flow
      * depending on ceratin specified by the programmer. Conditional
      * statements will always evalute to true or false. Conditions are
      * used in IF, Evaluate, and Perform statements. Differents types
      * are as follows:
      *
      * - If Condition Statements
      * - Relation Condition
      * - Sign Condition
      * - Class Condition
      * - Condition-Name Condition
      * - Negated Condition
      * - Combined Condition
      * 
       IDENTIFICATION DIVISION.
           PROGRAM-ID. CONDITIONAL-STATEMENTS.
       
       PROCEDURE DIVISION.
           DISPLAY "CONDITIONAL-STATEMENTS".
       STOP RUN.
       