      * A comment is a charater string that does not affect the 
      * execution of a program. It can be any combination of characters.
      *
      * There are two types of comments:
      *    - Comment Line
      *        - a comment line can be written in any column. The 
      *          compiler does not check a comment line for syntax and
      *          treats it for documentation.
      *    - Comment Entry
      *        - are those comments that are included in the optional
      *          paragraphs of an Idnetification Division. They are
      *          written in Area B and programmers use it for refernece
      *
       IDENTIFICATION DIVISION.
           PROGRAM-ID. COMMENT.

       PROCEDURE DIVISION.
      * This is a comment line and I can 
           DISPLAY "THIS PROGRAM INCLUDES COMMENTS".
       STOP RUN.
       