      * For every example for the different sub-folders, one should 
      * assume that there is a table named as 'Student' that contains
      * Student-Id, Student-Name, and Student-Address.
      *
      * Lets assume that the table would look something similar to:
      *
      * | Student Id | Student Name | Student Address |
      *  ---------------------------------------------
      * | 1001       | John Doe     | Street 123      |
      *  ---------------------------------------------
      * | 1002       | Mary Jane    | Street 321      |
      *  ---------------------------------------------
      * | 1003       | Super Mario  | Street ABC      |
      *  ---------------------------------------------
      *
       IDENTIFICATION DIVISION.
           PROGRAM-ID. SQL-QUERIES.

       PROCEDURE DIVISION.
           DISPLAY "SQL-QUERIES".
       STOP RUN.
       