      * There are some tasks that need to be done over and over again,
      * like reading each record of a file till its end. This is 
      * handled by loops, not only in COBOL but in every programming
      * lanaguage. The loop statements used in COBOL are the following:
      *
      * - Perform Thru
      * - Perform Until
      * - Perform Times
      * - Perform Varying
      * 
       IDENTIFICATION DIVISION.
           PROGRAM-ID. LOOP-STATEMENTS.
       
       PROCEDURE DIVISION.
           DISPLAY "LOOP-STATEMENTS".
       STOP RUN.
       