      * IDENTIFICATION DIVISON
      * 
      * It is the first and only mandatory division of every program.
      * The programmer and the compiler use this division to identify
      * program. In this divions, PROGRAM-ID is the only mandatory
      * PARAGRAPH. PROGRAM-ID specifies the program name that can
      * consist of 1 to 30 characters.
      *
       IDENTIFICATION DIVISION.
           PROGRAM-ID. IDENTIFICATION.
           AUTHOR. MARKUS SAARIJÄRVI.
           DATE-WRITTEN. 29th March 2023.
       
       PROCEDURE DIVISION.
           DISPLAY "EXECUTE PROGRAM WITH IDENTIFICATION DIVISION".
       STOP RUN.