      * String handling statements in COBOL are used to dod multiple 
      * functional operations on strings. Following are the string
      * handling statements:
      *
      * - Inspect
      * - String
      * - Unstring
      * 
       IDENTIFICATION DIVISION.
           PROGRAM-ID. STRING-HANDLING.
       
       PROCEDURE DIVISION.
           DISPLAY "STRING-HANDLING".
       STOP RUN.
       