           01 ABC.
           03 NAME.
               05 FIRSTNAME PIC X(10).
               05 SECONDNAME PIC X(10).
           03 PLACE.
               05 ZIP PIC X(05).
               05 CITY PIC X(20).
               05 STREET PIC X(20).
